{
  "career": [
    {
      "name": "Uber",
      "href": "https://www.uber.com/",
      "title": "Senior Technical Writer",
      "logo": "/uber-logo-square.jpg",
      "start": "May 2021",
      "end": "Present",
      "description": [
        "Lead day-to-day operations of the IT Knowledge Management team, overseeing 400+ knowledge resources for AI, SaaS, Cloud, and Enterprise applications in partnership with Engineers, App Owners, and Program Managers—maintaining an average article rating of 4.72/5 by prioritizing documentation accuracy, relevance, and governance.",
        "Launch Uber’s internal GenAI Knowledge Hub in ServiceNow and Confluence, creating 80+ documentation resources for tools like ChatGPT, Gemini, Glean, and Zoom AI, and driving 120K+ new page visits across Uber’s internal platforms.",
        "Design, structure, and build 12+ internal documentation microsites in support of business-critical workflows from separate departments (Contract Management, Payments, Global Security, Legal), ensuring alignment with Uber's documentation guidelines, enterprise data security, and compliance policies.",
        "Develop and pilot an agentic workflow that analyzed and scored 70+ knowledge articles for AI-readiness, improving user satisfaction with internal AI assistants by 30%; this initiative is now being adopted by other knowledge teams at Uber.",
        "Architect the content hierarchy and taxonomy tree of Uber's new central wiki by reviewing, retiring and migrating 800+ resources from dispersed legacy repositories."
      ]
    },
    {
      "name": "BairesDev",
      "href": "https://www.bairesdev.com/",
      "title": "Marketing & Communications Assistant",
      "logo": "/bairesdev-logo.svg",
      "start": "May 2019",
      "end": "May 2021",
      "description": [
        "Lead SEO optimization for 50+ services landing pages, achieving ~80% first-page Google rankings through improved metadata and structure, keyword optimization, and refining copy to match user intent—rather than marketing buzzwords.",
        "Scale blog content production by 4× (from 8 to 32 articles per month) by designing and executing a content strategy centered on SEO growth of service landing pages, managing external writers, and reviewing strategic alignment of all deliverables.",
        "Ghostwrite and edit thought leadership content for C-level executives across Forbes Tech Council, LinkedIn, and the company blog, elevating brand voice and increasing follower engagement in their personal profiles by 2.5× on average."
      ]
    },
    {
      "name": "Almerco",
      "href": "https://almerco.pe/",
      "title": "Marketing Associate",
      "logo": "/almerco-logo.png",
      "start": "Dec 2018",
      "end": "May 2019",
      "description": [
        "Redesign and manage the firm’s WordPress website, improving UX/UI, responsiveness, and content structure by implementing plugins, rewriting copy, and defining page hierarchies—establishing the company’s new digital presence.",
        "Develop 20+ presentation decks and infographics for client meetings, transforming legal data into accessible visuals that elevated communication and professionalism."
      ]
    },
    {
      "name": "Waldorf Astoria Park City",
      "href": "https://www.hilton.com/en/hotels/slcdmwa-waldorf-astoria-park-city/",
      "title": "Host / Guest Services",
      "logo": "/waldorf-astoria-logo.svg",
      "start": "Dec 2017",
      "end": "Apr 2018",
      "description": [
        "Deliver exceptional guest experiences by managing reservations, seating logistics, and personalized service for high-profile clientele, maintaining 5-star guest satisfaction scores."
      ]
    },
    {
      "name": "Tekton Labs",
      "href": "https://www.tektonlabs.com/",
      "title": "Content Intern",
      "logo": "/tekton-labs-logo-2.svg",
      "start": "Nov 2016",
      "end": "Nov 2017",
      "description": [
        "Assist in the weekly production of blog posts, videos, and other pieces of content for the company’s website and social media."
      ]
    }
  ]
}
